<?php

namespace Faker\Provider\fa_IR;

use IntlDateFormatter;

class Payment extends \Faker\Provider\Payment
{
    protected static $cardVendors = [
        'ملی', 'سپه', 'توسعه صادرات', 'صنعت و معدن', 'کشاورزی', 'مسکن',
        'پست بانک', 'توسعه تعاون', 'اقتصاد نوین', 'پارسیان', 'پاسارگاد',
        'کارآفرین', 'سامان', 'سینا', 'سرمایه', 'تات', 'شهر', 'دی', 'صادرات',
        'ملت', 'تجارت', 'رفاه', 'انصار', 'مهر اقتصاد',
    ];

    /**
     * @var array List of card brand masks for generating valid credit card numbers
     *
     * @see https://fa.wikipedia.org/wiki/%D8%B4%D9%85%D8%A7%D8%B1%D9%87_%DA%A9%D8%A7%D8%B1%D8%AA_%D9%BE%D8%B1%D8%AF%D8%A7%D8%AE%D8%AA Reference for existing prefixes
     * Iran BIN Expansion
     */
    protected static $cardParams = [
        'ملی' => [
            '603799#########',
        ],
        'سپه' => [
            '589210#########',
        ],
        'توسعه صادرات' => [
            '627648#########',
        ],
        'صنعت و معدن' => [
            '627961#########',
        ],
        'کشاورزی' => [
            '603770#########',
        ],
        'مسکن' => [
            '628023#########',
        ],
        'پست بانک' => [
            '627760#########',
        ],
        'توسعه تعاون' => [
            '502908#########',
        ],
        'اقتصاد نوین' => [
            '627412#########',
        ],
        'پارسیان' => [
            '622106#########',
        ],
        'پاسارگاد' => [
            '502229#########',
        ],
        'کارآفرین' => [
            '627488#########',
        ],
        'سامان' => [
            '621986#########',
        ],
        'سینا' => [
            '639346#########',
        ],
        'سرمایه' => [
            '639607#########',
        ],
        'تات' => [
            '636214#########',
        ],
        'شهر' => [
            '502806#########',
        ],
        'دی' => [
            '502938#########',
        ],
        'صادرات' => [
            '603769#########',
        ],
        'ملت' => [
            '610433#########',
        ],
        'تجارت' => [
            '627353#########',
        ],
        'رفاه' => [
            '589463#########',
        ],
        'انصار' => [
            '627381#########',
        ],
        'مهر اقتصاد' => [
            '639370#########',
        ],

    ];

    /**
     * @var array list of IBAN formats, source: @see https://www.swift.com/standards/data-standards/iban
     */
    protected static $ibanFormats = [
        'AD' => [['n', 4],    ['n', 4],  ['c', 12]],
        'AE' => [['n', 3],    ['n', 16]],
        'AL' => [['n', 8],    ['c', 16]],
        'AT' => [['n', 5],    ['n', 11]],
        'AZ' => [['a', 4],    ['c', 20]],
        'BA' => [['n', 3],    ['n', 3],  ['n', 8],  ['n', 2]],
        'BE' => [['n', 3],    ['n', 7],  ['n', 2]],
        'BG' => [['a', 4],    ['n', 4],  ['n', 2],  ['c', 8]],
        'BH' => [['a', 4],    ['c', 14]],
        'BR' => [['n', 8],    ['n', 5],  ['n', 10], ['a', 1],  ['c', 1]],
        'CH' => [['n', 5],    ['c', 12]],
        'CR' => [['n', 4],    ['n', 14]],
        'CY' => [['n', 3],    ['n', 5],  ['c', 16]],
        'CZ' => [['n', 4],    ['n', 6],  ['n', 10]],
        'DE' => [['n', 8],    ['n', 10]],
        'DK' => [['n', 4],    ['n', 9],  ['n', 1]],
        'DO' => [['c', 4],    ['n', 20]],
        'EE' => [['n', 2],    ['n', 2],  ['n', 11], ['n', 1]],
        'EG' => [['n', 4],    ['n', 4],  ['n', 17]],
        'ES' => [['n', 4],    ['n', 4],  ['n', 1],  ['n', 1],  ['n', 10]],
        'FI' => [['n', 6],    ['n', 7],  ['n', 1]],
        'FR' => [['n', 5],    ['n', 5],  ['c', 11], ['n', 2]],
        'GB' => [['a', 4],    ['n', 6],  ['n', 8]],
        'GE' => [['a', 2],    ['n', 16]],
        'GI' => [['a', 4],    ['c', 15]],
        'GR' => [['n', 3],    ['n', 4],  ['c', 16]],
        'GT' => [['c', 4],    ['c', 20]],
        'HR' => [['n', 7],    ['n', 10]],
        'HU' => [['n', 3],    ['n', 4],  ['n', 1],  ['n', 15], ['n', 1]],
        'IE' => [['a', 4],    ['n', 6],  ['n', 8]],
        'IL' => [['n', 3],    ['n', 3],  ['n', 13]],
        'IR' => [['n', 2],    ['n', 3],  ['n', 1],  ['n', 16]],
        'IS' => [['n', 4],    ['n', 2],  ['n', 6],  ['n', 10]],
        'IT' => [['a', 1],    ['n', 5],  ['n', 5],  ['c', 12]],
        'KW' => [['a', 4],    ['n', 22]],
        'KZ' => [['n', 3],    ['c', 13]],
        'LB' => [['n', 4],    ['c', 20]],
        'LI' => [['n', 5],    ['c', 12]],
        'LT' => [['n', 5],    ['n', 11]],
        'LU' => [['n', 3],    ['c', 13]],
        'LV' => [['a', 4],    ['c', 13]],
        'MC' => [['n', 5],    ['n', 5],  ['c', 11], ['n', 2]],
        'MD' => [['c', 2],    ['c', 18]],
        'ME' => [['n', 3],    ['n', 13], ['n', 2]],
        'MK' => [['n', 3],    ['c', 10], ['n', 2]],
        'MR' => [['n', 5],    ['n', 5],  ['n', 11], ['n', 2]],
        'MT' => [['a', 4],    ['n', 5],  ['c', 18]],
        'MU' => [['a', 4],    ['n', 2],  ['n', 2],  ['n', 12], ['n', 3],  ['a', 3]],
        'NL' => [['a', 4],    ['n', 10]],
        'NO' => [['n', 4],    ['n', 6],  ['n', 1]],
        'PK' => [['a', 4],    ['c', 16]],
        'PL' => [['n', 8],    ['n', 16]],
        'PS' => [['a', 4],    ['c', 21]],
        'PT' => [['n', 4],    ['n', 4],  ['n', 11], ['n', 2]],
        'RO' => [['a', 4],    ['c', 16]],
        'RS' => [['n', 3],    ['n', 13], ['n', 2]],
        'SA' => [['n', 2],    ['c', 18]],
        'SE' => [['n', 3],    ['n', 16], ['n', 1]],
        'SI' => [['n', 5],    ['n', 8],  ['n', 2]],
        'SK' => [['n', 4],    ['n', 6],  ['n', 10]],
        'SM' => [['a', 1],    ['n', 5],  ['n', 5],  ['c', 12]],
        'TN' => [['n', 2],    ['n', 3],  ['n', 13], ['n', 2]],
        'TR' => [['n', 5],    ['n', 1],  ['c', 16]],
        'VG' => [['a', 4],    ['n', 16]],
    ];

    /**
     * @param bool   $valid                True (by default) to get a valid expiration date, false to get a maybe valid date
     * @param string $expirationDateFormat
     *
     * @return string
     *
     * @example '۰۵/۰۱'
     */
    public function creditCardExpirationDateString($valid = true, $expirationDateFormat = null)
    {
        $formatter = new IntlDateFormatter(
            "fa_IR@calendar=persian",
            IntlDateFormatter::FULL,
            IntlDateFormatter::FULL,
            'Asia/Tehran',
            IntlDateFormatter::TRADITIONAL,
            "yy/MM"
        );

        return $formatter->format($this->creditCardExpirationDate($valid));
    }
}
